//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//*************************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//*************************************************************************
// Revision History
// ----------------
// $Log: $
// 
//*************************************************************************
//<AMI_FHDR_START>
//
// Name:	SB.UNI
//
// Description:	South Bridge setup string definitions 
//
//<AMI_FHDR_END>
//*************************************************************************

/=#
#include "VFR.uni"

#string STR_SB_FORM                             #language eng "PCH-IO Configuration"
#string STR_SB_FORM_HELP                        #language eng "PCH Parameters"

#string STR_PCH_RC_VER_HELP                     #language eng "Intel PCH RC Version"
#string STR_PCH_RC_VER_NAME                     #language eng "Intel PCH RC Version"
#string STR_PCH_RC_VER_VALUE                    #language eng "N/A" //dynamically updated

#string STR_PCH_SKU_HELP                        #language eng "Intel PCH SKU Name"
#string STR_PCH_SKU_NAME                        #language eng "Intel PCH SKU Name"
#string STR_PCH_SKU_VALUE                       #language eng "N/A" //dynamically updated

#string STR_PCH_REVID_HELP                      #language eng "Intel PCH Rev ID"
#string STR_PCH_REVID_NAME                      #language eng "Intel PCH Rev ID"
#string STR_PCH_REVID_VALUE                     #language eng "N/A" //dynamically updated

#string STR_PCH_PCICLOCKRUN_PROMPT              #language eng "CLKRUN# Logic"
#string STR_PCH_PCICLOCKRUN_HELP                #language eng "Enable the CLKRUN# logic to stop the PCI clocks."

#string STR_PCH_DISPLAY_PROMPT                  #language eng "Display Logic"
#string STR_PCH_DISPLAY_HELP                    #language eng "Enable or disable the PCH Display logic."

#string STR_SB_CRID_ENABLE                      #language eng  "SB CRID"
#string STR_SB_CRID_ENABLE_HELP                 #language eng  "Enable or disable SB Compatible Revision ID."

//----------------------------------------------------------------------------
// BIOS Security Configuration
//----------------------------------------------------------------------------
#string STR_BIOS_SECURITY_SUBTITLE              #language eng "BIOS Security Configuration"

#string STR_PCH_BIOS_SECURITY_OPTIONS_FORM_TITLE #language eng "BIOS Security Configuration"
#string STR_PCH_BIOS_SECURITY_OPTIONS_FORM_HELP #language eng "BIOS Security Configuration settings."

#string STR_SB_SMI_LOCK_ENABLE                  #language eng  "SMI Lock"
#string STR_SB_SMI_LOCK_ENABLE_HELP             #language eng  "Enable or disable SMI lockdown."

#string STR_SB_BIOS_INTERFACE_LOCK_ENABLE       #language eng  "BIOS Interface Lock"
#string STR_SB_BIOS_INTERFACE_LOCK_ENABLE_HELP  #language eng  "Enable or disable BIOS Interface lockdown."

#string STR_SB_GPIO_LOCK_ENABLE                 #language eng  "GPIO Lock"
#string STR_SB_GPIO_LOCK_ENABLE_HELP            #language eng  "Enable or disable GPIO lockdown."

#string STR_SB_BIOS_LOCK_ENABLE                 #language eng  "BIOS Lock"
#string STR_SB_BIOS_LOCK_ENABLE_HELP            #language eng  "Enable or disable BIOS lock enable (BLE) bit."

#string STR_SB_RTC_LOCK_ENABLE                  #language eng  "RTC RAM Lock"
#string STR_SB_RTC_LOCK_ENABLE_HELP             #language eng  "Enable or disable bytes 38h-3Fh in the upper and lower 128-byte bank of RTC RAM lockdown."

//----------------------------------------------------------------------------
// SATA Configuration
//----------------------------------------------------------------------------
#string STR_SATA_CONFIG_FORM                    #language eng "SATA Configuration"
#string STR_SATA_CONFIG_FORM_HELP               #language eng "SATA Device Options Settings"
#string STR_PCH_SATA_PROMPT                     #language eng "SATA Controller(s)"
#string STR_PCH_SATA_HELP                       #language eng "Enable or disable SATA Device."

#string STR_SATA_MODE_SELECTION_PROMPT          #language eng "SATA Mode Selection"
#string STR_SATA_MODE_SELECTION_HELP            #language eng "Determines how SATA controller(s) operate."
#string STR_SATA_IDE                            #language eng "IDE"
#string STR_SATA_AHCI                           #language eng "AHCI"
#string STR_SATA_RAID                           #language eng "RAID"
#string STR_SATA_TEST_MODE_PROMPT               #language eng "SATA Test Mode"
#string STR_SATA_TEST_MODE_HELP                 #language eng "Enable or disable Test Mode."
#string STR_SATA_AHCI_SALP                      #language eng "Aggressive LPM Support"
#string STR_SATA_AHCI_SALP_HELP                 #language eng "Enable PCH to aggressively enter link power state."

#string STR_SATA_SPEED                          #language eng "SATA Controller Speed"
#string STR_SATA_SPEED_HELP                     #language eng "Indicates the maximum speed the SATA controller can support."
#string STR_SATA_SPEED_DEFAULT                  #language eng "Default"
#string STR_SATA_SPEED_GEN1                     #language eng "Gen1"
#string STR_SATA_SPEED_GEN2                     #language eng "Gen2"
#string STR_SATA_SPEED_GEN3                     #language eng "Gen3"

#string STR_SATA_ALTERNATE_ID_PROMPT            #language eng "Alternate ID"
#string STR_SATA_ALTERNATE_ID_HELP              #language eng "Report alternate Device ID"

#string STR_SATA_SFMS_OPTIONS_FORM_TITLE        #language eng "Software Feature Mask Configuration"
#string STR_SATA_SFMS_OPTIONS_FORM_HELP         #language eng "RAID OROM/RST driver will refer to the SWFM configuration to enable or disable the storage features."
#string STR_PCH_RAID0_PROMPT                    #language eng "RAID0"
#string STR_PCH_RAID0_HELP                      #language eng "Enable or disable RAID0 feature."
#string STR_PCH_RAID1_PROMPT                    #language eng "RAID1"
#string STR_PCH_RAID1_HELP                      #language eng "Enable or disable RAID1 feature."
#string STR_PCH_RAID10_PROMPT                   #language eng "RAID10"
#string STR_PCH_RAID10_HELP                     #language eng "Enable or disable RAID10 feature."
#string STR_PCH_RAID5_PROMPT                    #language eng "RAID5"
#string STR_PCH_RAID5_HELP                      #language eng "Enable or disable RAID5 feature."
#string STR_PCH_IRRT_PROMPT                     #language eng "Intel Rapid Recovery Technology"
#string STR_PCH_IRRT_HELP                       #language eng "Enable or disable Intel Rapid Recovery Technology."
#string STR_PCH_OUB_PROMPT                      #language eng "OROM UI and BANNER"
#string STR_PCH_OUB_HELP                        #language eng "If enabled, then the OROM UI is shown. Otherwise, no OROM banner or information will be displayed if all disks and RAID volumes are Normal."
#string STR_PCH_HDDLK_PROMPT                    #language eng "HDD Unlock"
#string STR_PCH_HDDLK_HELP                      #language eng "If enabled, indicates that the HDD password unlock in the OS is enabled."
#string STR_PCH_LEDL_PROMPT                     #language eng "LED Locate"
#string STR_PCH_LEDL_HELP                       #language eng "If enabled, indicates that the LED/SGPIO hardware is attached and ping to locate feature is enabled on the OS."
#string STR_PCH_IOOE_PROMPT                     #language eng "IRRT Only on eSATA"
#string STR_PCH_IOOE_HELP                       #language eng "If enabled, then only IRRT volumes can span internal and eSATA drives. If disabled, then any RAID volume can span internal and eSATA drives."
#string STR_PCH_SMARTS_PROMPT                   #language eng "Smart Response Technology"
#string STR_PCH_SMARTS_HELP                     #language eng "Enable or disable Smart Response Technology."
#string STR_PCH_OROM_DELAL_PROMPT               #language eng "OROM UI Delay"
#string STR_PCH_OROM_DELAL_HELP                 #language eng "If enabled, indicates the delay of the OROM UI Splash Screen in a normal status."

#string STR_2_SECS_DELAY_STRING                 #language eng "2 Seconds"
#string STR_4_SECS_DELAY_STRING                 #language eng "4 Seconds"
#string STR_6_SECS_DELAY_STRING                 #language eng "6 Seconds"
#string STR_8_SECS_DELAY_STRING                 #language eng "8 Seconds"

#string STR_SATA0_STRING                        #language eng "Serial ATA Port 0"
#string STR_SATA0_NAME                          #language eng "Empty"
#string STR_SATA1_STRING                        #language eng "Serial ATA Port 1"
#string STR_SATA1_NAME                          #language eng "Empty"
#string STR_SATA2_STRING                        #language eng "Serial ATA Port 2"
#string STR_SATA2_NAME                          #language eng "Empty"
#string STR_SATA3_STRING                        #language eng "Serial ATA Port 3"
#string STR_SATA3_NAME                          #language eng "Empty"
#string STR_SATA4_STRING                        #language eng "Serial ATA Port 4"
#string STR_SATA4_NAME                          #language eng "Empty"
#string STR_SATA5_STRING                        #language eng "Serial ATA Port 5"
#string STR_SATA5_NAME                          #language eng "Empty"

#string STR_SATA_PORT_0                         #language eng "  Port 0"
#string STR_SATA_PORT_1                         #language eng "  Port 1"
#string STR_SATA_PORT_2                         #language eng "  Port 2"
#string STR_SATA_PORT_3                         #language eng "  Port 3"
#string STR_SATA_PORT_4                         #language eng "  Port 4"
#string STR_SATA_PORT_5                         #language eng "  Port 5"
#string STR_SATA_PORT_HELP                      #language eng "Enable or Disable SATA Port"

#string STR_SATA_HOTPLUG                        #language eng "  Hot Plug"
#string STR_SATA_PORT_HOTPLUG_HELP              #language eng "Designates this port as Hot Pluggable."

#string STR_EXTERNAL_SATA                       #language eng "  External SATA"
#string STR_EXTERNAL_SATA_HELP                  #language eng "External SATA Support."

#string STR_SATA_MECHANICAL_SW                  #language eng  "  Mechanical Presence Switch"
#string STR_SATA_MECHANICAL_SW_HELP             #language eng  "Controls reporting if this port has an Mechanical Presence Switch.\n\nNote: Requires hardware support."

#string STR_SATA_DEVICE_TYPE                    #language eng "  SATA Device Type"
#string STR_SATA_DEVICE_TYPE_HELP               #language eng "Identify the SATA port is connected to Solid State Drive or Hard Disk Drive."
#string STR_SATA_DEVICE_HDD                     #language eng "Hard Disk Drive"
#string STR_SATA_DEVICE_SSD                     #language eng "Solid State Drive"

#string STR_SATA_SPIN_UP                        #language eng "  Spin Up Device"
#string STR_SATA_SPIN_UP_HELP                   #language eng "On an edge detect from 0 to 1, the PCH starts a COMRESET initialization sequence to the device."

#string STR_SATA_DEV_SLP                        #language eng "  Device Sleep"
#string STR_SATA_DEV_SLP_HELP                   #language eng "mSata for RTD3"

#string STR_SATA_DITO_CONF                      #language eng "  SATA DEVSLEP Idle Timeout Config"
#string STR_SATA_DITO_CONF_HELP                 #language eng "Enable/Disable SATA DTIO Config"
#string STR_SATA_DITOVAL_CONF                   #language eng "  SATA DTIO Value"
#string STR_SATA_DITOVAL_CONF_HELP              #language eng "DEVSLEP Idle Timeout Value"
#string STR_SATA_DMVAL_CONF                     #language eng "  SATA DITO Multiplier Value"
#string STR_SATA_DMVAL_CONF_HELP                #language eng "DITO Multiplier Value"

#string STR_SOFT_PRESERVE                       #language eng "  Software Preserve"
#string STR_SATA0_SOFT_PRESERVE_STATUS          #language eng "Unknown"
#string STR_SATA1_SOFT_PRESERVE_STATUS          #language eng "Unknown"
#string STR_SATA2_SOFT_PRESERVE_STATUS          #language eng "Unknown"
#string STR_SATA3_SOFT_PRESERVE_STATUS          #language eng "Unknown"
#string STR_SATA4_SOFT_PRESERVE_STATUS          #language eng "Unknown"
#string STR_SATA5_SOFT_PRESERVE_STATUS          #language eng "Unknown"

#string STR_SATA_LEGACY_RAID_ROM_PROMPT         #language eng "SATA RAID ROM"
#string STR_SATA_LEGACY_RAID_ROM_HELP           #language eng "Enable or disable Legacy RAID Option ROM execution."
#string STR_SATA_ROM_PROMPT                     #language eng "SATA RAID ROM"
#string STR_SATA_ROM_HELP                       #language eng "Legacy ROM: Legacy option ROM\nUEFI Driver: UEFI Raid Driver\nBoth: Run the legacy Option ROM and UEFI driver"
#string STR_SATA_LEGACYROM                      #language eng "Legacy ROM"
#string STR_SATA_UEFIRAID                       #language eng "UEFI Driver"
#string STR_SATA_BOTH                           #language eng "Both"
//----------------------------------------------------------------------------
// PCH AZALIA Configuration
//----------------------------------------------------------------------------
#string STR_PCH_AZALIA_OPTIONS_FORM_TITLE       #language eng "PCH Azalia Configuration"
#string STR_PCH_AZALIA_OPTIONS_FORM_HELP        #language eng "PCH Azalia Configuration settings."

#string STR_PCH_AZALIA_PROMPT                   #language eng "Azalia"
#string STR_PCH_AZALIA_HELP                     #language eng "Control Detection of the Azalia device.\n\nDisabled = Azalia will be unconditionally disabled\n\nEnabled = Azalia will be unconditionally Enabled\n\nAuto = Azalia will be enabled if present, disabled otherwise."

#string STR_AZALIA_DS_PROMPT                    #language eng "  Azalia Docking Support"
#string STR_AZALIA_DS_HELP                      #language eng "Enable or disable Azalia Docking Support of Audio Controller."
#string STR_AZALIA_PME_PROMPT                   #language eng "  Azalia PME"
#string STR_AZALIA_PME_HELP                     #language eng "Enable or disable Power Management capability of Audio Controller."
#string STR_HDMI_CODEC_PROMPT                   #language eng "  Azalia Internal HDMI Codec"
#string STR_HDMI_CODEC_HELP                     #language eng "Enable or disable internal HDMI codec for Azalia."
#string STR_HDMI_CODEC_PORTB_PROMPT             #language eng "    Azalia HDMI codec Port B"
#string STR_HDMI_CODEC_PORTC_PROMPT             #language eng "    Azalia HDMI codec Port C"
#string STR_HDMI_CODEC_PORTD_PROMPT             #language eng "    Azalia HDMI codec Port D"
#string STR_HDMI_CODEC_PORT_HELP                #language eng "Enable or disable internal HDMI codec Port for Azalia."
//----------------------------------------------------------------------------
// USB Configuration
//----------------------------------------------------------------------------
#string STR_USB_OPTIONS_FORM_TITLE              #language eng "USB Configuration" 
#string STR_USB_OPTIONS_FORM_HELP               #language eng "USB Configuration settings" 

#string STR_PCH_USB_RMH1_EN_PROMPT              #language eng "RMH1"
#string STR_PCH_USB_RMH1_EN_HELP                #language eng "Enable or disable RMH1."

#string STR_PCH_USB_PRECONDITION_PROMPT         #language eng "USB Precondition"
#string STR_PCH_USB_PRECONDITION_HELP           #language eng "Precondition work on USB host controller and root ports for faster enumeration."

#string STR_PCH_USB30_MODE_PROMPT               #language eng "XHCI Mode"
#string STR_PCH_USB30_MODE_HELP                 #language eng "Mode of operation of xHCI controller."

#string STR_PCH_USB30_HSPORT0_PROMPT            #language eng "  HS Port #1 Switchable"
#string STR_PCH_USB30_HSPORT1_PROMPT            #language eng "  HS Port #2 Switchable"
#string STR_PCH_USB30_HSPORT2_PROMPT            #language eng "  HS Port #3 Switchable"
#string STR_PCH_USB30_HSPORT3_PROMPT            #language eng "  HS Port #4 Switchable"
#string STR_PCH_USB30_PER_HSPORT_HELP           #language eng "Allows for HS port switching between xHCI and EHCI.\n\nIf disabled, port is routed to EHCI.\n\nIf HS port is routed to xHCI, the corresponfing SS port is enabled."

//#string STR_PCH_USB_XHCISTREAMS_PROMPT          #language eng "  xHCI Streams"
//#string STR_PCH_USB_XHCISTREAMS_HELP            #language eng "Enable or disable xHCI Maximum Primary Stream Array Size."

#string STR_PCH_USB30_PBOOT_SUPPORT_PROMPT      #language eng "XHCI Pre-Boot Driver"
#string STR_PCH_USB30_PBOOT_SUPPORT_HELP        #language eng "Enable or disable XHCI Pre-Boot Driver support."

#string STR_PCH_USB30_IDLEL1_SUPPORT_PROMPT     #language eng "XHCI Idle L1"
#string STR_PCH_USB30_IDLEL1_SUPPORT_HELP       #language eng "Enable or disable XHCI Idle L1.\n XhciIdleL1 can be set to disable for LPT-LP Ax stepping to workaround USB3 hot plug will fail after 1 hot plug removal."

#string STR_PCH_USB30_BTCG_SUPPORT_PROMPT       #language eng "BTCG"
#string STR_PCH_USB30_BTCG_SUPPORT_HELP         #language eng "Enabling/disabling trunk clock gating."

#string STR_PCH_USB21_PROMPT                    #language eng "EHCI1"
#string STR_PCH_USB22_PROMPT                    #language eng "EHCI2"
#string STR_PCH_USB2_HELP                       #language eng "Control the USB EHCI (USB 2.0) functions.\n\nOne EHCI controller must always be enabled."
#string STR_PCH_USB_PER_PORT_PROMPT             #language eng "USB Ports Per-Port Disable Control"
#string STR_PCH_USB_PER_PORT_HELP               #language eng "Control each of the USB ports (0~13) disabling."
#string STR_PCH_USB_CON_DISCON_WAKEUP_PROMPT    #language eng "EHCI Connect/Disconnect Wake Up"
#string STR_PCH_USB_CON_DISCON_WAKEUP_HELP      #language eng "To wake up system by connect/disconnect USB device."
#string STR_PCH_USB_PORT0_PROMPT                #language eng "  USB Port #0"
#string STR_PCH_USB_PORT1_PROMPT                #language eng "  USB Port #1"
#string STR_PCH_USB_PORT2_PROMPT                #language eng "  USB Port #2"
#string STR_PCH_USB_PORT3_PROMPT                #language eng "  USB Port #3"
#string STR_PCH_USB_PORT4_PROMPT                #language eng "  USB Port #4"
#string STR_PCH_USB_PORT5_PROMPT                #language eng "  USB Port #5"
#string STR_PCH_USB_PORT6_PROMPT                #language eng "  USB Port #6"
#string STR_PCH_USB_PORT7_PROMPT                #language eng "  USB Port #7"
#string STR_PCH_USB_PORT8_PROMPT                #language eng "  USB Port #8"
#string STR_PCH_USB_PORT9_PROMPT                #language eng "  USB Port #9"
#string STR_PCH_USB_PORT10_PROMPT               #language eng "  USB Port #10"
#string STR_PCH_USB_PORT11_PROMPT               #language eng "  USB Port #11"
#string STR_PCH_USB_PORT12_PROMPT               #language eng "  USB Port #12"
#string STR_PCH_USB_PORT13_PROMPT               #language eng "  USB Port #13"
#string STR_PCH_USB30_PORT0_PROMPT              #language eng "  USB30 Port #0"
#string STR_PCH_USB30_PORT1_PROMPT              #language eng "  USB30 Port #1"
#string STR_PCH_USB30_PORT2_PROMPT              #language eng "  USB30 Port #2"
#string STR_PCH_USB30_PORT3_PROMPT              #language eng "  USB30 Port #3"
#string STR_PCH_USB30_PORT4_PROMPT              #language eng "  USB30 Port #4"
#string STR_PCH_USB30_PORT5_PROMPT              #language eng "  USB30 Port #5"
#string STR_PCH_USB_PORT_DIS_HELP               #language eng "Enable / Disable USB port."
#string STR_PCH_USB30_PORT_DIS_HELP             #language eng "Disable USB30 port."

#string STR_PCH_ROUTE_USB20_PIN_TO_HC           #language eng "Route USB 2.0 pins to which HC?"
#string STR_PCH_ROUTE_USB20_PIN_TO_HC_HELP      #language eng "Route USB 2.0 pins to EHCI or XHCI."
#string STR_PCH_ENABLE_USB30_PIN                #language eng "Enable USB 3.0 pins"
#string STR_PCH_ENABLE_USB30_PIN_HELP           #language eng "Enable or disable xHCI SuperSpeed support."
#string STR_PCH_USB_20_PIN0                     #language eng "USB 2.0 PIN #0"
#string STR_PCH_USB_20_PIN1                     #language eng "USB 2.0 PIN #1"
#string STR_PCH_USB_20_PIN2                     #language eng "USB 2.0 PIN #2"
#string STR_PCH_USB_20_PIN3                     #language eng "USB 2.0 PIN #3"
#string STR_PCH_USB_20_PIN4                     #language eng "USB 2.0 PIN #4"
#string STR_PCH_USB_20_PIN5                     #language eng "USB 2.0 PIN #5"
#string STR_PCH_USB_20_PIN6                     #language eng "USB 2.0 PIN #6"
#string STR_PCH_USB_20_PIN7                     #language eng "USB 2.0 PIN #7"
#string STR_PCH_USB_20_PIN8                     #language eng "USB 2.0 PIN #8"
#string STR_PCH_USB_20_PIN9                     #language eng "USB 2.0 PIN #9"
#string STR_PCH_USB_20_PIN10                    #language eng "USB 2.0 PIN #10"
#string STR_PCH_USB_20_PIN11                    #language eng "USB 2.0 PIN #11"
#string STR_PCH_USB_20_PIN12                    #language eng "USB 2.0 PIN #12"
#string STR_PCH_USB_20_PIN13                    #language eng "USB 2.0 PIN #13"
#string STR_PCH_USB_30_PIN1                     #language eng "USB 3.0 PIN #1"
#string STR_PCH_USB_30_PIN2                     #language eng "USB 3.0 PIN #2"
#string STR_PCH_USB_30_PIN3                     #language eng "USB 3.0 PIN #3"
#string STR_PCH_USB_30_PIN4                     #language eng "USB 3.0 PIN #4"
#string STR_PCH_USB_30_PIN5                     #language eng "USB 3.0 PIN #5"
#string STR_PCH_USB_30_PIN6                     #language eng "USB 3.0 PIN #6"

#string STR_ROUTE_PER_PIN                       #language eng "Route Per-Pin"
#string STR_ROUTE_ALL_PIN_EHCI                  #language eng "Route all Pins to EHCI"
#string STR_ROUTE_ALL_PIN_XHCI                  #language eng "Route all Pins to XHCI"
#string STR_ROUTE_TO_EHCI                       #language eng "Route to EHCI"
#string STR_ROUTE_TO_XHCI                       #language eng "Route to XHCI"

#string STR_SELECT_PER_PIN                      #language eng "Select Per-Pin"
#string STR_SELECT_ALL_PIN_DISABLE              #language eng "Disable all Pins"
#string STR_SELECT_ALL_PIN_ENABLE               #language eng "Enable all Pins"
//----------------------------------------------------------------------------
// NIC & SMBus Configuration
//----------------------------------------------------------------------------
#string STR_SMBUS_PROMPT                        #language eng "SMBus Controller"
#string STR_SMBUS_HELP                          #language eng "Enable or disable OnChip SMBus Controller."

//----------------------------------------------------------------------------
// LAN Configuration
//----------------------------------------------------------------------------
#string STR_PCH_LAN_CONTROLLER                  #language eng "PCH LAN Controller"
#string STR_PCH_LAN_CONTROLLER_HELP             #language eng "Enable or disable onboard NIC."
#string STR_PCH_LAN_WOL_PROMPT                  #language eng "  Wake on LAN"
#string STR_PCH_LAN_WOL_HELP                    #language eng "Enable or disable integrated LAN to wake the system. (The Wake On LAN cannot be disabled if ME is on at Sx state.)"
#string STR_PCH_SLP_LAN_LOW_PROMPT              #language eng "  SLP_LAN# Low on DC Power"
#string STR_PCH_SLP_LAN_LOW_HELP                #language eng "Enable/Disable SLP_LAN# Low on DC Power."
#string STR_BOARD_CAPABILITY                    #language eng "Board Capability"
#string STR_BOARD_CAPABILITY_HELP               #language eng "Board Capability - SUS_PWR_DN_ACK -> Send Disabled to PCH, DeepSx -> Show DeepSx Policies"
#string STR_SUS_PWR_DN_ACK_STRING               #language eng "SUS_PWR_DN_ACK"
#string STR_DEEP_SX_STRING                      #language eng "DeepSx"

//----------------------------------------------------------------------------
// Deep Sx Configuration
//----------------------------------------------------------------------------
#string STR_DEEP_SX_POWER_POLICIES_PROMPT       #language eng "DeepSx Power Policies"
#string STR_DEEP_SX_POWER_POLICIES_HELP         #language eng "Configure the DeepSx Mode configuration."
#string STR_DEEP_SX_GP27_WAKE_PROMPT            #language eng "GP27 Wake From DeepSx"
#string STR_DEEP_SX_GP27_WAKE_HELP              #language eng "Wake from DeepSx by the assertion of GP27 pin."
#string STR_DEEP_SX_PCIE_WAKE_PROMPT            #language eng "PCIE Wake From DeepSx"
#string STR_DEEP_SX_PCIE_WAKE_HELP              #language eng "Wake from DeepSx by the assertion of PCIE."

#string STR_DEEPSX_S5_BATT_STRING               #language eng "Enabled in S5/Battery"
#string STR_DEEPSX_S5_STRING                    #language eng "Enabled in S5"
#string STR_DEEPSX_S4_S5_BATT_STRING            #language eng "Enabled in S4-S5/Battery"
#string STR_DEEPSX_S4_S5_STRING                 #language eng "Enabled in S4-S5"
#string STR_DEEPSX_S3_S4_S5_BATT_STRING         #language eng "Enabled in S3-S4-S5/Battery"

//----------------------------------------------------------------------------
// PCI Express Root Port Configuration
//----------------------------------------------------------------------------
#string STR_PCIERP1_OPTIONS_FORM_TITLE          #language eng "PCI Express Root Port 1" 
#string STR_PCIERP1_OPTIONS_FORM_HELP           #language eng "PCI Express Root Port 1 Settings." 
#string STR_PCIERP2_OPTIONS_FORM_TITLE          #language eng "PCI Express Root Port 2" 
#string STR_PCIERP2_OPTIONS_FORM_HELP           #language eng "PCI Express Root Port 2 Settings." 
#string STR_PCIERP3_OPTIONS_FORM_TITLE          #language eng "PCI Express Root Port 3" 
#string STR_PCIERP3_OPTIONS_FORM_HELP           #language eng "PCI Express Root Port 3 Settings." 
#string STR_PCIERP4_OPTIONS_FORM_TITLE          #language eng "PCI Express Root Port 4" 
#string STR_PCIERP4_OPTIONS_FORM_HELP           #language eng "PCI Express Root Port 4 Settings." 
#string STR_PCIERP5_OPTIONS_FORM_TITLE          #language eng "PCI Express Root Port 5" 
#string STR_PCIERP5_OPTIONS_FORM_HELP           #language eng "PCI Express Root Port 5 Settings." 
#string STR_PCIERP6_OPTIONS_FORM_TITLE          #language eng "PCI Express Root Port 6" 
#string STR_PCIERP6_OPTIONS_FORM_HELP           #language eng "PCI Express Root Port 6 Settings." 
#string STR_PCIERP7_OPTIONS_FORM_TITLE          #language eng "PCI Express Root Port 7" 
#string STR_PCIERP7_OPTIONS_FORM_HELP           #language eng "PCI Express Root Port 7 Settings." 
#string STR_PCIERP8_OPTIONS_FORM_TITLE          #language eng "PCI Express Root Port 8" 
#string STR_PCIERP8_OPTIONS_FORM_HELP           #language eng "PCI Express Root Port 8 Settings." 

#string STR_PCIE_OPTIONS_FORM_TITLE             #language eng "PCI Express Configuration"
#string STR_PCIE_OPTIONS_FORM_HELP              #language eng "PCI Express Configuration settings"
#string STR_PCIE_ROOT_PORT_TITLE                #language eng "PCI Express Root Port Setting"

#string STR_PCIE_ASPM_PROMPT                    #language eng "ASPM"
#string STR_PCIE_ASPM_HELP                      #language eng "PCI Express Active State Power Management settings."
#string STR_PCIE_ASPM_L0S_STRING                #language eng "L0s"
#string STR_PCIE_ASPM_L1_STRING                 #language eng "L1"
#string STR_PCIE_ASPM_L0SL1_STRING              #language eng "L0sL1"

#string STR_PCIE_L1S_PROMPT                     #language eng "L1 Substates"
#string STR_PCIE_L1S_HELP                       #language eng "PCI Express L1 Substates settings."
#string STR_PCIE_L1S_L11_STRING                 #language eng "L1.1"
#string STR_PCIE_L1S_L12_STRING                 #language eng "L1.2"
#string STR_PCIE_L1S_L11_L12_STRING             #language eng "L1.1 & L1.2"

#string STR_PCIE_CKG_PROMPT                     #language eng "PCI Express Clock Gating"
#string STR_PCIE_CKG_HELP                       #language eng "Enable or disable PCI Express Clock Gating for each root port."

#string STR_PCIE_PORT_SWAP_PROMPT               #language eng "PCIE Root Port Function Swapping"
#string STR_PCIE_PORT_SWAP_HELP                 #language eng "Enable or disable PCI Express PCI Express Root Port Function Swapping."

#string STR_PCH_PCIE_USB_WA_PROMPT              #language eng "PCIe-USB Glitch W/A"
#string STR_PCH_PCIE_USB_WA_HELP                #language eng "PCIe-USB Glitch W/A for bad USB device(s) connected behind PCIE/PEG Port."

#string STR_PCH_DMI_ASPM_PROMPT                 #language eng "DMI Link ASPM Control" 
#string STR_PCH_DMI_ASPM_HELP                   #language eng "The control of Active State Power Management on both NB side and SB side of the DMI Link."

#string STR_PCH_DMI_ES_PROMPT                   #language eng "DMI Link Extended Synch Control" 
#string STR_PCH_DMI_ES_HELP                     #language eng "The control of Extended Synch on SB side of the DMI Link."

#string STR_PCH_PCIERP1_PROMPT                  #language eng "PCI Express Root Port 1"
#string STR_PCH_PCIERP2_PROMPT                  #language eng "PCI Express Root Port 2"
#string STR_PCH_PCIERP3_PROMPT                  #language eng "PCI Express Root Port 3"
#string STR_PCH_PCIERP4_PROMPT                  #language eng "PCI Express Root Port 4"
#string STR_PCH_PCIERP5_PROMPT                  #language eng "PCI Express Root Port 5"
#string STR_PCH_PCIERP6_PROMPT                  #language eng "PCI Express Root Port 6"
#string STR_PCH_PCIERP7_PROMPT                  #language eng "PCI Express Root Port 7"
#string STR_PCH_PCIERP8_PROMPT                  #language eng "PCI Express Root Port 8"
#string STR_PCH_PCIERP_HELP                     #language eng "Control the PCI Express Root Port."

#string STR_PCIE_LANRP1_PROMPT                  #language eng "PCIE Port 1 is assigned to LAN"
#string STR_PCIE_LANRP2_PROMPT                  #language eng "PCIE Port 2 is assigned to LAN"
#string STR_PCIE_LANRP3_PROMPT                  #language eng "PCIE Port 3 is assigned to LAN"
#string STR_PCIE_LANRP4_PROMPT                  #language eng "PCIE Port 4 is assigned to LAN"
#string STR_PCIE_LANRP5_PROMPT                  #language eng "PCIE Port 5 is assigned to LAN"
#string STR_PCIE_LANRP6_PROMPT                  #language eng "PCIE Port 6 is assigned to LAN"
#string STR_PCIE_LANRP7_PROMPT                  #language eng "PCIE Port 7 is assigned to LAN"
#string STR_PCIE_LANRP8_PROMPT                  #language eng "PCIE Port 8 is assigned to LAN"

#string STR_PCIE_EXT_SYNCH_PROMPT               #language eng "Extended Synch"
#string STR_PCIE_EXT_SYNCH_HELP                 #language eng "Enable PCIe Extended Synchronization for Logic Analyzer use."

#string STR_PCH_PCIE_URE_PROMPT                 #language eng "  URR"
#string STR_PCH_PCIE_URE_HELP                   #language eng "Enable or disable PCI Express Unsupported Request Reporting."

#string STR_PCH_PCIE_FEE_PROMPT                 #language eng "  FER"
#string STR_PCH_PCIE_FEE_HELP                   #language eng "Enable or disable PCI Express Device Fatal Error Reporting."

#string STR_PCH_PCIE_NFE_PROMPT                 #language eng "  NFER"
#string STR_PCH_PCIE_NFE_HELP                   #language eng "Enable or disable PCI Express Device Non-Fatal Error Reporting."

#string STR_PCH_PCIE_CEE_PROMPT                 #language eng "  CER"
#string STR_PCH_PCIE_CEE_HELP                   #language eng "Enable or disable PCI Express Device Correctable Error Reporting."

#string STR_PCH_PCIE_CTD_PROMPT                 #language eng "  CTO"
#string STR_PCH_PCIE_CTD_HELP                   #language eng "Enable or disable PCI Express Completion Timer TO."

#string STR_PCH_PCIE_SFE_PROMPT                 #language eng "  SEFE"
#string STR_PCH_PCIE_SFE_HELP                   #language eng "Enable or disable Root PCI Express System Error on Fatal Error."

#string STR_PCH_PCIE_SNE_PROMPT                 #language eng "  SENFE"
#string STR_PCH_PCIE_SNE_HELP                   #language eng "Enable or disable Root PCI Express System Error on Non-Fatal Error."

#string STR_PCH_PCIE_SCE_PROMPT                 #language eng "  SECE"
#string STR_PCH_PCIE_SCE_HELP                   #language eng "Enable or disable Root PCI Express System Error on Correctable Error."

#string STR_PCH_PCIE_PMCE_PROMPT                #language eng "  PME SCI"
#string STR_PCH_PCIE_PMCE_HELP                  #language eng "Enable or disable PCI Express PME SCI."

#string STR_PCH_PCIE_HPE_PROMPT                 #language eng "  Hot Plug"
#string STR_PCH_PCIE_HPE_HELP                   #language eng "Enable or disable PCI Express Hot Plug."

#string STR_PCH_PCIE_SPEED_PROMPT               #language eng "PCIe Speed"
#string STR_PCH_PCIE_SPEED_HELP                 #language eng "Select PCI Express port speed."
#string STR_PCH_PCIE_GEN1                       #language eng "Gen1"
#string STR_PCH_PCIE_GEN2                       #language eng "Gen2"

#string STR_PCH_PCIE_SBDE_PROMPT                #language eng "Subtractive Decode"
#string STR_PCH_PCIE_SBDE_HELP                  #language eng "Enable or disable PCI Express Subtractive Decode."

#string STR_PCH_PCIE_SBDE_PORT_PROMPT           #language eng "  Subtractive Decode Port#"
#string STR_PCH_PCIE_SBDE_PORT_HELP             #language eng "Select PCI Express Subtractive Decode Root Port. User to ensure port availability"

#string STR_PCH_PCIE_NON_COMPLIANCE_PROMPT      #language eng "Detect Non-Compliance Device"
#string STR_PCH_PCIE_NON_COMPLIANCE_HELP        #language eng "Detect Non-Compliance PCI Express Device. If enable, it will take more time at POST time."

#string STR_PCH_PCIE_RBUS_PROMPT                #language eng "Extra Bus Reserved"
#string STR_PCH_PCIE_RBUS_HELP                  #language eng "Extra Bus Reserved (0-7) for bridges behind this Root Bridge."

#string STR_PCH_PCIE_RMEM_PROMPT                #language eng "Reseved Memory"
#string STR_PCH_PCIE_RMEM_HELP                  #language eng "Reserved Memory Range for this Root Bridge."

#string STR_PCH_PCIE_RMEM_ALIG_PROMPT           #language eng "Reseved Memory Alignment"
#string STR_PCH_PCIE_RMEM_ALIG_HELP             #language eng "Reseved Memory Alignment (0 - 31 bits)"

#string STR_PCH_PCIE_PF_RMEM_PROMPT             #language eng "Prefetchable Memory"
#string STR_PCH_PCIE_PF_RMEM_HELP               #language eng "Prefetchable Memory Range for this Root Bridge."

#string STR_PCH_PCIE_PF_RMEM_ALIG_PROMPT        #language eng "Prefetchable Memory Alignment"
#string STR_PCH_PCIE_PF_RMEM_ALIG_HELP          #language eng "Prefetchable Memory Alignment (0 - 31 bits)"

#string STR_PCH_PCIE_RVIO_PROMPT                #language eng "Reserved I/O"
#string STR_PCH_PCIE_RVIO_HELP                  #language eng "Reserved I/O (4K/8K/12K/16K/.../48K) Range for this Root Bridge."

#string STR_PCH_PCIE_LTR_ENABLE_PROMPT                                  #language eng "PCIE LTR"
#string STR_PCH_PCIE_LTR_ENABLE_HELP                                    #language eng "PCIE Latency Reporting Enable/Disable."
#string STR_PCH_PCIE_LTR_CONFIGLOCK_PROMPT                              #language eng "PCIE LTR Lock"
#string STR_PCH_PCIE_LTR_CONFIGLOCK_HELP                                #language eng "PCIE LTR Configuration Lock."
#string STR_PCH_PCIE_SNOOP_LATENCY_OVERRIDE_MODE_PROMPT                 #language eng "Snoop Latency Override"
#string STR_PCH_PCIE_SNOOP_LATENCY_OVERRIDE_MODE_HELP                   #language eng "Snoop Latency Override for PCH PCIE."
#string STR_PCH_PCIE_SNOOP_LATENCY_OVERRIDE_MULITIPLIER_PROMPT          #language eng "Snoop Latency Multiplier"
#string STR_PCH_PCIE_SNOOP_LATENCY_OVERRIDE_MULITIPLIER_HELP            #language eng "Snoop Latency Multiplier for PCH PCIE."
#string STR_PCH_PCIE_SNOOP_LATENCY_OVERRIDE_VALUE_PROMPT                #language eng "Snoop Latency Value"
#string STR_PCH_PCIE_SNOOP_LATENCY_OVERRIDE_VALUE_HELP                  #language eng "Snoop Latency Value for PCH PCIE."
#string STR_PCH_PCIE_NON_SNOOP_LATENCY_OVERRIDE_MODE_PROMPT             #language eng "Non Snoop Latency Override"
#string STR_PCH_PCIE_NON_SNOOP_LATENCY_OVERRIDE_MODE_HELP               #language eng "Non Snoop Latency Override for PCH PCIE."
#string STR_PCH_PCIE_NON_SNOOP_LATENCY_OVERRIDE_MULITIPLIER_PROMPT      #language eng "Non Snoop Latency Multiplier"
#string STR_PCH_PCIE_NON_SNOOP_LATENCY_OVERRIDE_MULITIPLIER_HELP        #language eng "Non Snoop Latency Multiplier for PCH PCIE."
#string STR_PCH_PCIE_NON_SNOOP_LATENCY_OVERRIDE_VALUE_PROMPT            #language eng "Non Snoop Latency Value"
#string STR_PCH_PCIE_NON_SNOOP_LATENCY_OVERRIDE_VALUE_HELP              #language eng "Non Snoop Latency Value for PCH PCIE."
#string STR_1_NS                                                        #language eng "1 ns"
#string STR_32_NS                                                       #language eng "32 ns"
#string STR_1024_NS                                                     #language eng "1024 ns"
#string STR_32768_NS                                                    #language eng "32768 ns"
#string STR_1048576_NS                                                  #language eng "1048576 ns"
#string STR_33554432_NS                                                 #language eng "33554432 ns"

//----------------------------------------------------------------------------
// Misc. Configuration
//----------------------------------------------------------------------------
#string STR_SLP_S4_ASSW_PROMPT                                          #language eng "SLP_S4 Assertion Width"
#string STR_SLP_S4_ASSW_HELP                                            #language eng "Select a minimum assertion width of the SLP_S4# signal"
#string STR_ONE_SECOND                                                  #language eng "1-2 Seconds"
#string STR_TWO_SECOND                                                  #language eng "2-3 Seconds"
#string STR_THREE_SECOND                                                #language eng "3-4 Seconds"
#string STR_FOUR_SECOND                                                 #language eng "4-5 Seconds"

#string STR_PCH_IRQMODE_PROMPT                                          #language eng "Serial IRQ Mode"
#string STR_PCH_IRQMODE_HELP                                            #language eng "Configure Serial IRQ Mode."
#string STR_IRQ_QUIET                                                   #language eng "Quiet"
#string STR_IRQ_CONTINUOUS                                              #language eng "Continuous"

#string STR_LAST_STATE_PROMPT                                           #language eng "Restore AC Power Loss"
#string STR_LAST_STATE_HELP                                             #language eng "Select AC power state when power is re-applied after a power failure."
#string STR_POWER_ON                                                    #language eng "Power On"
#string STR_POWER_OFF                                                   #language eng "Power Off"
#string STR_LAST_STATE                                                  #language eng "Last State"

#string STR_PORT_80_PROMPT                                              #language eng "Port 80h Redirection"
#string STR_PORT_80_HELP                                                #language eng "Control where the Port 80h cycles are sent."
#string STR_LPC_BUS                                                     #language eng "LPC Bus"
#string STR_PCI_BUS                                                     #language eng "PCIE Bus"

//----------------------------------------------------------------------------
// HPET Configuration
//----------------------------------------------------------------------------
#string STR_HPET_PROMPT                                                 #language eng "High Precision Timer"
#string STR_HPET_HELP                                                   #language eng "Enable or Disable the High Precision Event Timer."
#string STR_HPET_SUBTITLE                                               #language eng "High Precision Event Timer Configuration"

//----------------------------------------------------------------------------
// Thermal Configuration
//----------------------------------------------------------------------------
#string STR_THERMAL_CONFIGURATION                                       #language eng "Thermal Configuration"
#string STR_THERMAL_CONFIGURATION_HELP                                  #language eng "Thermal Configuration Parameters"

#string STR_PLATFORM_FORM                                               #language eng "Platform Information"
#string STR_PLATFORM_FORM_HELP                                          #language eng "Platform Information"

#string STR_PLATFORM_THERMAL_CONFIG_FORM_TITLE                          #language eng "Platform Thermal Configuration"
#string STR_PLATFORM_THERMAL_CONFIG_FORM_HELP                           #language eng "Platform Thermal Configuration options"

#string STR_TMRC_CONFIG_FORM_TITLE                                      #language eng "Thermal Memory Reference Code (TMRC) Configuration"
#string STR_TMRC_CONFIG_FORM_HELP                                       #language eng "Thermal Memory Reference Code (TMRC) Configuration options"

#string STR_IPS_CONFIG_FORM_TITLE                                       #language eng "Intelligent Power Sharing"
#string STR_IPS_CONFIG_FORM_HELP                                        #language eng "Intelligent Power Sharing Options"

#string STR_DPPM_CONFIG_FORM_TITLE                                      #language eng "DPPM Configuration"
#string STR_DPPM_CONFIG_FORM_HELP                                       #language eng "DPPM Configuration options"

#string STR_OUT_OF_SPEC                                                 #language eng "Critical Temp Reporting (Out Of spec)"

//----------------------------------------------------------------------------
// Dynamic Power Performance Management
//----------------------------------------------------------------------------
#string STR_DPPM_PROMPT                                                 #language eng "DPPM"
#string STR_DPPM_HELP                                                   #language eng "Enable or disable Intel Dynamic Power Performance Management"

#string STR_PROC_THERMAL_DEVICE_PROMPT                                  #language eng "Processor Camarillo Device"
#string STR_PROC_THERMAL_DEVICE_HELP                                    #language eng "Enable or disable Processor Camarillo Device."
#string STR_MCP_CAMARILLO_ENABLED                                       #language eng "MCP Camarillo Device"
#string STR_CPU_CAMARILLO_ENABLED                                       #language eng "CPU Camarillo Device"

#string STR_PCH_THERMAL_SSDT_PROMPT                                     #language eng "PCH Camarillo Device"
#string STR_PCH_THERMAL_SSDT_HELP                                       #language eng "Enable or disable PCH Camarillo Device."

#string STR_TSCO_ENABLE_LOCK                                            #language eng "TSCO Enable Lock"
#string STR_TSCO_ENABLE_LOCK_HELP                                       #language eng "Lock down the Catastrophic Trip Point setting"
#string STR_TSPC_ENABLE_LOCK                                            #language eng "TSPC Enable Lock"
#string STR_TSPC_ENABLE_LOCK_HELP                                       #language eng "Lock down the Thermal Sensor Policy Control and Aux Trip Point Settings"
#string STR_TS_ENABLE_LOCK                                              #language eng "TS Enable Lock"
#string STR_TS_ENABLE_LOCK_HELP                                         #language eng "Lock down the Thermal Sensor Register Lock Control Settings"
#string STR_PCH_HOT_LEVEL                                               #language eng "PCH Hot Level Select"
#string STR_STR_PCH_HOT_LVL_HELP                                        #language eng "PCHHOT#: This signal is used to indicate a PCH temperature out of bounds condition to an external EC, when PCH temperature is greater than value programmed by BIOS. An external pull-up resistor is required on this signal."
#string STR_OPTIONAL_OBJECTS                                            #language eng "Optional Objects"
#string STR_OPTIONAL_OBJECTS_HELP                                       #language eng "Enable all DPPM optional objects (methods which are optional for CRB)."


//----------------------------------------------------------------------------
// Platform Thermal Configuration
//----------------------------------------------------------------------------
#string STR_THERMAL_REPORTING_PROMPT                                    #language eng "Automatic Thermal Reporting"
#string STR_THERMAL_REPORTING_HELP                                      #language eng "Configure _CRT, _PSV and _AC0 automatically based on values recommended in BWG's Thermal Reporting for Thermal Management settings. Set to Disabled for manual configuration."
#string STR_ACPI_ACTIVE_THERMAL_TRIP_POINT_LOW                          #language eng "Active Trip Point 1"
#string STR_ACPI_ACTIVE_THERMAL_TRIP_POINT_HELP_LOW                     #language eng "This value controls the temperature of the ACPI Active Trip Point 1 - the point in which the OS will turn the processor fan on Active Trip Point 1 Fan Speed."
#string STR_ACPI_ACTIVE_THERMAL_TRIP_POINT_HIGH                         #language eng "Active Trip Point 0"
#string STR_ACPI_ACTIVE_THERMAL_TRIP_POINT_HELP_HIGH                    #language eng "This value controls the temperature of the ACPI Active Trip Point 0 - the point in which the OS will turn the processor fan on Active Trip Point 0 Fan Speed."
#string STR_ACPI_PASSIVE_THERMAL_TRIP_POINT                             #language eng "Passive Trip Point"
#string STR_ACPI_PASSIVE_THERMAL_TRIP_POINT_HELP                        #language eng "This value controls the temperature of the ACPI Passive Trip Point - the point in which the OS will begin throttling the processor."
#string STR_ACPI_CRITICAL_THERMAL_TRIP_POINT                            #language eng "Critical Trip Point"
#string STR_ACPI_CRITICAL_THERMAL_TRIP_POINT_HELP                       #language eng "This value controls the temperature of the ACPI Critical Trip Point - the point in which the OS will shut the system off.\n\nNOTE:  100C is the Plan Of Record (POR) for all Intel mobile processors."
#string STR_15_C                                                        #language eng "15 C"
#string STR_23_C                                                        #language eng "23 C"
#string STR_31_C                                                        #language eng "31 C"
#string STR_39_C                                                        #language eng "39 C"
#string STR_47_C                                                        #language eng "47 C"
#string STR_55_C                                                        #language eng "55 C"
#string STR_63_C                                                        #language eng "63 C"
#string STR_71_C                                                        #language eng "71 C"
#string STR_79_C                                                        #language eng "79 C"
#string STR_87_C                                                        #language eng "87 C"
#string STR_95_C                                                        #language eng "95 C"
#string STR_103_C                                                       #language eng "103 C"
#string STR_111_C                                                       #language eng "111 C"
#string STR_119_C                                                       #language eng "119 C"
#string STR_127_C                                                       #language eng "127 C"
#string STR_POR                                                         #language eng "POR"
#string STR_0LEN                                                        #language eng ""

#string STR_AC0_FAN_SPEED                                               #language eng "Active Trip Point 0 Fan Speed"
#string STR_AC0_FAN_SPEED_HELP                                          #language eng "Active Trip Point 0 Fan Speed in percentage. Value must be betwen 0 (Fan off) - 100 (Max fan speed). This is the speed at which fan will run when Active Trip Point 0 is crossed."

#string STR_AC1_FAN_SPEED                                               #language eng "Active Trip Point 1 Fan Speed"
#string STR_AC1_FAN_SPEED_HELP                                          #language eng "Active Trip Point 1 Fan Speed in percentage. Value must be betwen 0 (Fan off) - 100 (Max fan speed). This value must be less than Active Trip Point 0 Fan speed. This is the speed at which fan will run when Active Trip 1 is crossed."

#string STR_ACPI_PASSIVE_TC1_VALUE                                      #language eng "  Passive TC1 Value"
#string STR_ACPI_PASSIVE_TC1_VALUE_HELP                                 #language eng "This value sets the TC1 value for the ACPI Passive Cooling Formula. Range 1 - 16"
#string STR_ACPI_PASSIVE_TC2_VALUE                                      #language eng "  Passive TC2 Value"
#string STR_ACPI_PASSIVE_TC2_VALUE_HELP                                 #language eng "This value value sets the TC2 value for the ACPI Passive Cooling Formula. Range 1 - 16"
#string STR_ACPI_PASSIVE_TSP_VALUE                                      #language eng "  Passive TSP Value"
#string STR_ACPI_PASSIVE_TSP_VALUE_HELP                                 #language eng "This item sets the TSP value for the ACPI Passive Cooling Formula.  It represents in tenths of a second how often the OS will read the temperature when passive cooling is enabled. Range 2 - 32"

#string STR_ME_TR_ENABLED_PROMPT                                        #language eng  "ME SMBus Thermal Reporting"
#string STR_ME_TR_ENABLED_HELP                                          #language eng  "Enable or disable ME SMBus Thermal Reporting Configuration"

#string STR_TR_SMBUS_EC_LEN_PROMPT                                      #language eng  "  SMBus Buffer Length"
#string STR_TR_SMBUS_EC_LEN_HELP                                        #language eng  "SMBus Block Read message length for EC."
#string STR_SMBUS_EC_MSG_LEN_1_STRING                                   #language eng  "1"
#string STR_SMBUS_EC_MSG_LEN_2_STRING                                   #language eng  "2"
#string STR_SMBUS_EC_MSG_LEN_5_STRING                                   #language eng  "5"
#string STR_SMBUS_EC_MSG_LEN_9_STRING                                   #language eng  "9"
#string STR_SMBUS_EC_MSG_LEN_10_STRING                                  #language eng  "10"
#string STR_SMBUS_EC_MSG_LEN_14_STRING                                  #language eng  "14"
#string STR_SMBUS_EC_MSG_LEN_20_STRING                                  #language eng  "20"

#string STR_TR_SMBUS_EC_PEC_PROMPT                                      #language eng  "  Thermal Reporting EC PEC"
#string STR_TR_SMBUS_EC_PEC_HELP                                        #language eng  "Enable Packet Error Checking (PEC) for SMBus Block Read"

#string STR_PCH_THERMAL_DEVICE_PROMPT                                   #language eng "PCH Thermal Device"
#string STR_PCH_THERMAL_DEVICE_HELP                                     #language eng "PCH Thermal Reporting Device configuration."
#string STR_RUN_TIME_INTERFACE                                          #language eng "Run Time Interface"
#string STR_RUN_TIME_INTERFACE_HELP                                     #language eng "Choose runtime interface for PCH communication"
#string STR_RUN_TIME_INTERFACE_SMBUS                                    #language eng "EC uses SMBus"
#string STR_RUN_TIME_INTERFACE_MMIO                                     #language eng "BIOS uses MMIO"
#string STR_ALERT_ENABLE_LOCK                                           #language eng "Alert Enable Lock"
#string STR_ALERT_ENABLE_LOCK_HELP                                      #language eng "Lock all Alert Enable settings"
#string STR_CPU_ALERT                                                   #language eng "  CPU Alert"
#string STR_CPU_ALERT_HELP                                              #language eng "CPU Alert pin enable"
#string STR_MCH_ALERT                                                   #language eng "  MCH Alert"
#string STR_MCH_ALERT_HELP                                              #language eng "MCH Alert pin enable"
#string STR_PCH_ALERT                                                   #language eng "  PCH Alert"
#string STR_PCH_ALERT_HELP                                              #language eng "PCH Alert pin enable"
#string STR_DIMM_ALERT                                                  #language eng "  DIMM Alert"
#string STR_DIMM_ALERT_HELP                                             #language eng "DIMM Alert pin enable"
#string STR_CPU_TEMP_READ                                               #language eng "  CPU Temp Read"
#string STR_CPU_TEMP_READ_HELP                                          #language eng "CPU Temperature Read Enable"
#string STR_CPU_ENERGY_READ                                             #language eng "  CPU Energy Read"
#string STR_CPU_ENERGY_READ_HELP                                        #language eng "CPU Energy Read Enable"
#string STR_THERMAL_DEVICE_ENABLE                                       #language eng "PCH Thermal Device"
#string STR_THERMAL_DEVICE_ENABLE_HELP                                  #language eng "Enable or disable PCH Thermal Device(D31:F6)"
#string STR_PCH_CROSS_THROTTLING_ENABLE                                 #language eng "PCH Cross Throttling"
#string STR_PCH_CROSS_THROTTLING_ENABLE_HELP                            #language eng "Enable or disable the PCH Cross Throttling feature."
#string STR_PCH_TEMP_READ                                               #language eng "  PCH Temp Read"
#string STR_PCH_TEMP_READ_HELP                                          #language eng "PCH Temperature Read Enable"
#string STR_DIMM1_TS_READ                                               #language eng "  DIMM1 TS READ"
#string STR_DIMM1_TS_READ_HELP                                          #language eng "DIMM1 Thermal Sensor Read Enable"
#string STR_DIMM2_TS_READ                                               #language eng "  DIMM2 TS READ"
#string STR_DIMM2_TS_READ_HELP                                          #language eng "DIMM2 Thermal Sensor Read Enable"
#string STR_DIMM3_TS_READ                                               #language eng "  DIMM3 TS READ"
#string STR_DIMM3_TS_READ_HELP                                          #language eng "DIMM3 Thermal Sensor Read Enable"
#string STR_DIMM4_TS_READ                                               #language eng "  DIMM4 TS READ"
#string STR_DIMM4_TS_READ_HELP                                          #language eng "DIMM4 Thermal Sensor Read Enable"

#string STR_TM1_PROMPT                                                  #language eng "TM1 "
#string STR_TM1_PROMPT_HELP                                             #language eng "Enable or disable Thermal Monitor1"
#string STR_TM2_PROMPT                                                  #language eng "TM2 "
#string STR_TM2_PROMPT_HELP                                             #language eng "Enable or disable Thermal Monitor2"

#string STR_PROC_HOT_ENABLE                                             #language eng "Bi-directional PROCHOT#"
#string STR_PROC_HOT_ENABLE_HELP                                        #language eng "When a processor thermal sensor trips (either core), the PROCHOT# will be driven.\nIf bi-direction is enabled, external agents can drive PROCHOT# to throttle the processor."
#string STR_ACPI_TSTATES_ENABLE                                         #language eng "ACPI 3.0 T-States"
#string STR_ACPI_TSTATES_ENABLE_HELP                                    #language eng "Enable or disable ACPI 3.0 T-States."

// EC turbo control test mode 
#string STR_ECTG                                                        #language eng "Toggle EC"
#string STR_ECTG_HELP                                                   #language eng "Enable or disable Toggle EC"

#string STR_EC_TURBO_CONTROL_MODE                                       #language eng "EC Turbo Control Mode"
#string STR_EC_TURBO_CONTROL_MODE_HELP                                  #language eng "Enable or disable EC Turbo Control mode"

#string STR_AC_BRICK_CAPACITY                                           #language eng "  AC Brick Capacity"
#string STR_AC_BRICK_CAPACITY_HELP                                      #language eng "Specify the AC Brick capacity"

#string STR_EC_POLLING_PERIOD                                           #language eng "  EC Polling Period"
#string STR_EC_POLLING_PERIOD_HELP                                      #language eng "Count 1 to 255 for a range of 10ms to 2.55 seconds (1 count = 10ms)"

#string STR_EC_GUARD_BAND                                               #language eng "  EC Guard Band Value"
#string STR_EC_GUARD_BAND_HELP                                          #language eng "Count 1 to 20 for a range of 1 watt to 20 watts"

#string STR_EC_ALGORITHM_SEL                                            #language eng "  EC Algorithm Selection"
#string STR_EC_ALGORITHM_SEL_HELP                                       #language eng "Count 1 to 10 for Algorithm Selection"

#string STR_90W_AC_BRICK                                                #language eng "90W AC Brick"
#string STR_65W_AC_BRICK                                                #language eng "65W AC Brick"
#string STR_75W_AC_BRICK                                                #language eng "75W AC Brick"

#string STR_HYBRID_POWER_BOOST_PROMPT                                   #language eng "  Hybrid Power Boost"
#string STR_HYBRID_POWER_BOOST_HELP                                     #language eng "Option to turn off the system charger hybrid mode on Slim River."

#string STR_HYBRID_CURRENT_PROMPT                                       #language eng "  Adapter Input current"
#string STR_HYBRID_CURRENT_HELP                                         #language eng "Max adapter input current in milli Amps."

//----------------------------------------------------------------------------
// PCHLP LPSS
//----------------------------------------------------------------------------
#string STR_LPSS_CONFIGURATION_TITLE                                    #language eng "LPSS Configuration"
#string STR_LPSS_CONFIGURATION_HELP                                     #language eng "LPSS Configuration Settings"
#string STR_LPSS_DMA_PROMPT                                             #language eng "DMA Controller"
#string STR_AUTO_BY_OS                                                  #language eng "Auto (depends on OS)"
#string STR_LPSS_DEVICE_HELP                                            #language eng "Enables/Disables the LPSS Controller"
#string STR_LPSS_I2C0_PROMPT                                            #language eng "I2C0 Controller"
#string STR_LPSS_I2C1_PROMPT                                            #language eng "I2C1 Controller"
#string STR_LPSS_SPI0_PROMPT                                            #language eng "SPI0 Controller"
#string STR_LPSS_SPI1_PROMPT                                            #language eng "SPI1 Controller"
#string STR_LPSS_UART0_PROMPT                                           #language eng "UART0 Controller"
#string STR_LPSS_UART1_PROMPT                                           #language eng "UART1 Controller"
#string STR_LPSS_SDIO_PROMPT                                            #language eng "SDIO Controller"
#string STR_LPSS_MODE_PROMPT                                            #language eng "LPSS Mode"
#string STR_LPSS_MODE_HELP                                              #language eng "Configure all LPSS Controllers in PCI or ACPI Mode"
#string STR_LPSS_INTMODE_PROMPT                                         #language eng "LPSS Interrupt Mode"
#string STR_I2C_VOL_PROMPT                                              #language eng "IO Voltage Select"
#string STR_I2C_VOL_HELP                                                #language eng "Select 1.8v or 3.3v for the controller."

#string STR_LPSS_ADSP_MODE_ACPI                                         #language eng "ACPI Mode"
#string STR_LPSS_ADSP_MODE_PCI                                          #language eng "PCI Mode"
#string STR_I2C_VOL_33V                                                 #language eng "3.3V"
#string STR_I2C_VOL_18V                                                 #language eng "1.8V"

#string STR_I2C_SEN_HUB_PROMPT                 	                        #language eng "Sensor Hub"
#string STR_I2C_SEN_HUB_HELP                  	                        #language eng "Enables/Disables the Vendor Sensor"
#string STR_I2C_TPD4_PROMPT                                             #language eng "TPD4"
#string STR_I2C_TPD4_HELP                                               #language eng "Enables/Disables the TPD4"
#string STR_I2C_ATMTPL_PROMPT                                           #language eng "Atmel TouchPanel"
#string STR_I2C_ATMTPL_HELP                                             #language eng "Enables/Disables the Atmel TouchPanel"
#string STR_I2C_ELATPL_PROMPT                 	                        #language eng "Elantech TouchPanel"
#string STR_I2C_ELATPL_HELP                  	                        #language eng "Enables/Disables the Elantech TouchPanel"
#string STR_I2C_ELANTPD_PROMPT                                          #language eng "Elantech TouchPad"
#string STR_I2C_ELANTPD_HELP                                            #language eng "Enables/Disables the Elantech TouchPad"
#string STR_I2C_SYNATPD_PROMPT                 	                        #language eng "Synaptics TouchPad"
#string STR_I2C_SYNATPD_HELP                  	                        #language eng "Enables/Disables the Synaptics TouchPad"
#string STR_I2C_NTRITPL_PROMPT                                          #language eng "N-Trig Digitizer Touch Panel"
#string STR_I2C_NTRITPL_HELP                  	                        #language eng "Enables/Disables the NTRIG Digitizer Touch Panel"
#string STR_I2C_EETITPL_PROMPT                                          #language eng "EETI Touch Panel"
#string STR_I2C_EETITPL_HELP                  	                        #language eng "Enables/Disables the EETI Touch Panel"
#string STR_I2C_ALPSTPD_PROMPT                                          #language eng "Alps Touchpad"
#string STR_I2C_ALPSTPD_HELP                  	                        #language eng "Enables/Disables the Alps Touchpad"
#string STR_I2C_CYPRTPD_PROMPT                                          #language eng "Cypress Touchpad"
#string STR_I2C_CYPRTPD_HELP                  	                        #language eng "Enables/Disables the Cypress Touchpad"
#string STR_UART_BLUETOOTH_PROMPT                                       #language eng "Intel BlueTooth"
#string STR_UART_BLUETOOTH_HELP                                         #language eng "Enables/Disables the Intel BlueTooth"
#string STR_SDIO_WIFI_PROMPT                 	                        #language eng "Intel Wifi"
#string STR_SDIO_WIFI_HELP                  	                        #language eng "Enables/Disables the Intel Wifi"

#string STR_I2C_I2C0SSH_CONF                  	                        #language eng "StandarSpeed SCL High"
#string STR_I2C_I2C0SSH_CONF_HELP              	                        #language eng "StandarSpeed SCL High"
#string STR_I2C_I2C0SSL_CONF                  	                        #language eng "StandarSpeed SCL Low"
#string STR_I2C_I2C0SSL_CONF_HELP              	                        #language eng "StandarSpeed SCL Low"
#string STR_I2C_I2C0SSD_CONF                  	                        #language eng "StandarSpeed SDA Hold"
#string STR_I2C_I2C0SSD_CONF_HELP              	                        #language eng "StandarSpeed SDA Hold"

#string STR_I2C_I2C0FMH_CONF                  	                        #language eng "FastSpeed SCL High"
#string STR_I2C_I2C0FMH_CONF_HELP              	                        #language eng "FastSpeed SCL High"
#string STR_I2C_I2C0FML_CONF                  	                        #language eng "FastSpeed SCL Low"
#string STR_I2C_I2C0FML_CONF_HELP              	                        #language eng "FastSpeed SCL Low"
#string STR_I2C_I2C0FMD_CONF                  	                        #language eng "FastSpeed SDA Hold"
#string STR_I2C_I2C0FMD_CONF_HELP              	                        #language eng "FastSpeed SDA Hold"

#string STR_I2C_I2C0FPH_CONF                  	                        #language eng "FastSpeedPlus SCL High"
#string STR_I2C_I2C0FPH_CONF_HELP                                   	#language eng "FastSpeedPlus SCL High"
#string STR_I2C_I2C0FPL_CONF                  	                        #language eng "FastSpeedPlus SCL Low"
#string STR_I2C_I2C0FPL_CONF_HELP              	                        #language eng "FastSpeedPlus SCL Low"
#string STR_I2C_I2C0FPD_CONF                  	                        #language eng "FastSpeedPlus SDA Hold"
#string STR_I2C_I2C0FPD_CONF_HELP              	                        #language eng "FastSpeedPlus SDA Hold"

#string STR_I2C_I2C0M0C0_CONF                                           #language eng "D0->D3 Idle timeout when screen off"
#string STR_I2C_I2C0M0C0_CONF_HELP                                      #language eng "D0->D3 Idle timeout when screen off"
#string STR_I2C_I2C0M1C0_CONF                                           #language eng "D0->D3 Idle timeout when screen on"
#string STR_I2C_I2C0M1C0_CONF_HELP                                      #language eng "D0->D3 Idle timeout when screen on"
#string STR_I2C_I2C0M2C0_CONF                                           #language eng "D3->D0 delay time (screen off)"
#string STR_I2C_I2C0M2C0_CONF_HELP                                      #language eng "D3->D0 delay time (screen off)"

//----------------------------------------------------------------------------
// PCHLP ADSP
//----------------------------------------------------------------------------
#string STR_ADSP_CONFIGURATION_TITLE                                    #language eng "Audio DSP Configuration"
#string STR_ADSP_CONFIGURATION_HELP                                     #language eng "Audio DSP Configuration Settings"
#string STR_ADSP_ENABLE_PROMPT                                          #language eng "Audio DSP"
#string STR_ADSP_ENABLE_HELP                                            #language eng "Control of the Audio DSP device."
#string STR_ADSP_D3PG_PROMPT                                            #language eng "Audio DSP D3 Power Gating"
#string STR_ADSP_D3PG_HELP                                              #language eng "Audio DSP D3 Power Gating in D3."
#string STR_ADSP_CODECSELECT_PROMPT                                     #language eng "Audio DSP Codec Select"
#string STR_ADSP_CODECSELECT_HELP                                       #language eng "Select codec configuration."
#string STR_ADSP_BLUETOOTH_PROMPT                                       #language eng "Bluetooth Support"
#string STR_ADSP_BLUETOOTH_HELP                                         #language eng "Enables/Disables the Bluetooth Support"
#string STR_ADSP_MODE_PROMPT                                            #language eng "Audio DSP Mode"
#string STR_ADSP_MODE_HELP                                              #language eng "Audio DSP device will be exposed as ACPI or PCI device."
#string STR_ADSP_SAFEMODE_PROMPT                                        #language eng "Audio DSP Safe Mode"
#string STR_ADSP_SAFEMODE_HELP                                          #language eng "Allows to disable part of ADSP PM programming.\nBIT0: LTRC\nBIT1: VDRTCTL2\nBIT2: VDLDAT1\nBIT3: PMCTL"

#string STR_ADSP_CODECSELECT_REALTEK                                    #language eng "Realtek"
#string STR_ADSP_CODECSELECT_CIRRUS                                     #language eng "Cirrus"
#string STR_ADSP_CODECSELECT_IDT                                        #language eng "Idt"

#string STR_NFCE_PROMPT                                                 #language eng "NFC Device"
#string STR_NFCE_HELP                                                   #language eng "Select NFC"
#string STR_NFCE_SKTD000                                                #language eng "SKTD000"
#string STR_NFCE_NXP5442                                                #language eng "NXP5442"
#string STR_NFCE_ICV0A12                                                #language eng "ICV0A12"

//----------------------------------------------------------------------------
// Common String
//----------------------------------------------------------------------------
#string STR_EMPTY_STRING                                                #language eng ""
#string STR_COMMON_AUTO                                                 #language eng "Auto"
#string STR_COMMON_SMART_AUTO                                           #language eng "Smart Auto"

#string STR_COMMON_ENABLED                                              #language eng "Enabled"

#string STR_COMMON_DISABLED                                             #language eng "Disabled"

#string STR_COMMON_MANUAL                                               #language eng "Manual"

//----------------------------------------------------------------------------
// AAEON RTC SMM
//----------------------------------------------------------------------------

#string STR_ENABLED                        #language eng "Enabled"
#string STR_DISABLED                       #language eng "Disabled"

#string STR_S5_RTCWAKE_FORM                #language eng "S5 RTC Wake Settings"
#string STR_S5_RTCWAKE_FORM_HELP           #language eng "Enable system to wake from S5 using RTC alarm"

//AAEON_RTC_001_Elflo >>
#string STR_WAKE_ON_RTC_PROMPT     			#language eng "System Wake On RTC"
#string STR_WAKE_ON_RTC_PROMPT_HELP     		#language eng "Fixed Time: System will wake on the hr::min::sec specified./n Dynamic Time: System will wake on the current time + Increase minute(s)"
#string STR_WOR_DISABLE		     			#language eng "Disabled"
#string STR_WOR_FIXED		     			#language eng "Fixed Time"
#string STR_WOR_DYNAMIC		     			#language eng "Dynamic Time"
//AAEON_RTC_001_Elflo <<

#string STR_WAKE_ON_RTC_PROMPT             #language eng "RTC wake system from S5"
#string STR_WAKE_ON_RTC_HELP               #language eng "Enable or disable System wake on alarm event. When enabled, System will wake on the hr::min::sec specified"
#string STR_FIXED_WAKE_ON_RTCS5_PROMPT     #language eng "Wake system with Fixed Time"
#string STR_FIXED_WAKE_ON_RTCS5_HELP       #language eng "Enable or disable System wake on alarm event. When enabled, System will wake on the hr::min::sec specified"
#string STR_DYNAMIC_WAKE_ON_RTCS5_PROMPT   #language eng "Wake system with Dynamic Time"
#string STR_DYNAMIC_WAKE_ON_RTCS5_HELP     #language eng "Enable or disable System wake on alarm event. When enabled, System will wake on the current time + Increase minute(s)"
#string STR_RTC_WAKEUP_HOUR_PROMPT         #language eng "  Wake up hour"
#string STR_RTC_HOUR_HELP                  #language eng "select 0-23 For example enter 3 for 3am and 15 for 3pm"
#string STR_RTC_WAKEUP_MINUTE_PROMPT       #language eng "  Wake up minute"
#string STR_RTC_WAKEUP_MINUTE_INCREASE_PROMPT    #language eng "  Wake up minute increase"
#string STR_RTC_WAKEUP_SECOND_PROMPT       #language eng "  Wake up second"
#string STR_RTC_DAY_HELP                   #language eng "Select 0 for daily system wake up 1-31 for which day of the month that you would like the system to wake up"
#string STR_TIME_MINUTE_HELP               #language eng  "0 - 59"
#string STR_TIME_MINUTE_INCREASE_HELP      #language eng  "1 - 5"
#string STR_TIME_SECOND_HELP               #language eng  "0 - 59"
#string STR_RTC_WAKEUP_DAY_PROMPT          #language eng "  Wake up day"
#string STR_RTC_DAY_HELP                   #language eng "Select 0 for daily system wake up, 1-31 for which day of the month that you would like the system to wake up"

//#### string <string name>                   #language eng ""

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************